Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.AnalysisModelDesignProperties Property
 Gets or sets the analysis model design properties.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelDesignProperties AnalysisModelDesignProperties { get; set; }
Public Property AnalysisModelDesignProperties As AnalysisModelDesignProperties
	Get
	Set
Property Value
Type: AnalysisModelDesignProperties
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace